app/controllers/accounts_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `role`, `password_salt`, `persistence_token`, `password`, `email`) VALUES('2010-02-07 13:15:54', 'bee8e5509ffa88d6e76c334e4f762583614a81a02367b5dea8e6f0e94fa18733960a62a6276de4ab2c04c73c94368dada8e6f60b956089d963c247db0117dc6f', '2010-02-07 13:15:54', 'A', 'yPofJVqibNMF1_bstjOn', '64252f399ffee35c9055167bae2607c3a66dded0930cbdcedb2c2e325e1b062542c42d2757bfef53b856b19a7e9267cf328d169617a2922140058e58a7da9b99', NULL, 'a@a.co')