app/controllers/pages_controller.rb

SELECT * FROM `users`
---
  def main
    if User.all.empty?