app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY last_name, first_name
---
  def index
    @users = User.all(:order => "nickname, last_name, first_name")

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `role`, `password_salt`, `persistence_token`, `password`, `email`) VALUES('2010-02-07 13:23:30', '3d20f35d639704868b13230bd665ad55ed4dd5e0f874ae89f78deec31a7349527e8ee5172fafd194d8558b3ab7198d7cf8c541dea615ba76b339b144d30b0e6b', '2010-02-07 13:23:30', 'A', 'p4HvGkDy2TXgGBc3VGmm', 'f149dd8aa91d2b2fe788edf29d2d2150ed5a567f91bef5e5b766ce588c0a50759fb2d51471bb1980ee0f37fa24d6fb354f8d3d2d6009f5652e09c59c801cdbda', NULL, 'foo7@example.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save